app/views/movies/index.html.erb

       <%= f.label(:country_id) %>
       <%= f.collection_select(:country_id, Country.all, :id, :name, selected: @search_params[:country_id], prompt: "") %>
        <%= f.label(:site_id) %>
        <%= f.collection_select(:site_id, Site.all, :id, :name, selected: @search_params[:site_id], prompt: "") %>
---
SELECT "countries".* FROM "countries"
SELECT "sites".* FROM "sites"