app/views/movies/new.html.erb

        <%= f.label :国 %>
        <%= f.collection_select :country_id, Country.all, :id, :name, include_blank: "選択して下さい" %>
---
SELECT "countries".* FROM "countries"

        <%= f.label :視聴サイト %>
        <%= f.collection_select :site_id, Site.all, :id, :name, include_blank: "選択して下さい" %>
---
SELECT "sites".* FROM "sites"