app/views/movies/show.html.erb

SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."tag_id" = ? LIMIT ?  [["user_id", 1], ["tag_id", nil], ["LIMIT", 1]]
---
       <% @tag_count.each do |c| %>
          <%= f.check_box :tag_id, { multiple: false, :checked => @votes.present? ? current_user.votes.exists?(tag_id: tag.id) : false, include_hidden: false }, c.id %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <div>
      <%= c.user.name unless c.user.blank? %>