app/views/users/show.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."user_id" = ?  [["user_id", 2]]
---
<div class="grid">
   <% @user.movies.each do |t| %>