app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
      @search_params = movie_search_params
      @movies = Movie.search(@search_params).includes(:site)
      @movies = Movie.search(@search_params).includes(:country)
---
SELECT "movies".* FROM "movies" WHERE (body LIKE '%クラス%' )
SELECT "movies".* FROM "movies" WHERE "movies"."site_id" = ?  [["site_id", "2"]]
SELECT "sites".* FROM "sites"
SELECT "countries".* FROM "countries" WHERE "countries"."id" IN (?, ?)  [["id", 1], ["id", 3]]

    def create
      @movie = Movie.new(movie_params)
      @movie.user_id =current_user.id
      if @movie.save
---
INSERT INTO "movies" ("created_at", "updated_at", "sentence", "image", "title", "country_id", "site_id", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def show
      @movie = Movie.find(params[:id])
      @reviews = @movie.reviews
      @review = @movie.reviews.build
      @tags = @movie.tags
      @tag = @movie.tags.build
      @vote = Vote.new
      @tag_count = Tag.find(Vote.group(:tag_id).order('count(tag_id)desc').pluck(:tag_id)).select{|tag| tag.movie_id == @movie.id}
      @votes = Vote.where(user_id: current_user)
      #@tag_count = Tag.find(MovieTag.group(:movie_id).group(:tag_id).order('count(tag_id)desc').select{|movie_tag| movie_tag.movie_id == @movie.id}.pluck(:tag_id))
      #@movie_tag = @movie.movie_tags.build
      #@tag_movie = Movie.find(params[:id]).tags.map(&:content)

      @review_rate = Review.select{|review| review.movie_id == @movie.id}.pluck(:rate)
      if @review_rate.empty?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tags"."id" FROM "tags" INNER JOIN "movie_tags" ON "tags"."id" = "movie_tags"."tag_id" WHERE "movie_tags"."movie_id" = ?  [["movie_id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = ?  [["user_id", 1]]
SELECT "tag_id" FROM "tags" GROUP BY "movie_id" ORDER BY count(tag_id) desc
SELECT "votes"."tag_id" FROM "votes" GROUP BY "movie_id", "votes"."tag_id" ORDER BY count(tag_id)desc
SELECT AVG("reviews"."rate") FROM "reviews"
SELECT "movies".* FROM "movies" INNER JOIN "movie_tags" ON "movie_tags"."movie_id" = "movies"."id" GROUP BY "movie_id" ORDER BY count(tag_id)desc
SELECT "reviews".* FROM "reviews"

    def update
      @movie = Movie.find(params[:id])
      if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "movies" SET "sentence" = ?, "image" = ?, "updated_at" = ? WHERE "movies"."id" = ?

    def destroy
      Movie.find(params[:id]).destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]