app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("rate", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rate", 4.0], ["comment", "おもしろかった\r\n"], ["user_id", 1], ["movie_id", 1], ["created_at", "2020-06-29 05:17:37.401038"], ["updated_at", "2020-06-29 05:17:37.401038"]]
---
    def create
      movie = Movie.find(params[:movie_id])
      @review = movie.reviews.build(review_params)
      @review.user_id = current_user.id
      if @review.save