app/controllers/tags_controller.rb

    def create
        movie = Movie.find(params[:movie_id])
        @tag = movie.tags.build(tag_params)
        @tag.users << current_user
        if @tag.save
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "movie_tags" ("movie_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["movie_id", 1], ["tag_id", 5], ["created_at", "2020-07-05 06:36:22.875632"], ["updated_at", "2020-07-05 06:36:22.875632"]]
INSERT INTO "tags" ("content", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", ""], ["movie_id", 1], ["created_at", "2020-06-30 07:20:09.889765"], ["updated_at", "2020-06-30 07:20:09.889765"]]
INSERT INTO "tags" ("content", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dd"], ["movie_id", 3], ["created_at", "2020-07-19 07:23:42.116486"], ["updated_at", "2020-07-19 07:23:42.116486"]]