app/controllers/votes_controller.rb

INSERT INTO "votes" ("tag_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tag_id", 15], ["user_id", 2], ["created_at", "2020-07-26 00:25:33.953137"], ["updated_at", "2020-07-26 00:25:33.953137"]]
---
    def create
        @vote = current_user.votes.create(vote_params)